# NumberOfPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..NumberOfPoints Property
DividedPath Class See Also
---
The total number of points of the divided surface. This combines the layout points and the intersection points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int NumberOfPoints { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfPoints As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfPoints {
	int get ();
}
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace